Repository: yoko-at-home/reactjs-docs-TM
Catalog: docs/jsx-in-depth_EN-US_ja.tmx
Source language: en_us
Languages: ja

source: --- id: jsx-in-depth title: JSX In Depth permalink: docs/jsx-in-depth.html redirect_from:
ja: --- id: jsx-in-depth title: JSX を深く理解する permalink: docs/jsx-in-depth.html redirect_from:

source: Fundamentally, JSX just provides syntactic sugar for the `React.createElement(component, props, ...children)` function.
ja: JSX とは、つまるところ `React.createElement(component, props, ...children)` の糖衣構文にすぎません。

source: The JSX code:
ja: 例として、次の JSX コードを見てみましょう。

source: compiles into:
ja: これは以下のようにコンパイルされます。

source: You can also use the self-closing form of the tag if there are no children.
ja: 子要素を持たない場合には、自己クローズ (self-closing) タグを利用することもできます。

source: So:
ja: 次のコードを見てください。

source: If you want to test out how some specific JSX is converted into JavaScript, you can try out [the online Babel compiler](babel://jsx-simple-example).
ja: 具体的に JSX がどのように JavaScript へ変換されるのかをテストしたい場合は、[オンライン Babel コンパイラ](babel://jsx-simple-example)で試すことができます。

source: ## Specifying The React Element Type {#specifying-the-react-element-type}
ja: ## React 要素の型を指定する {#specifying-the-react-element-type}

source: The first part of a JSX tag determines the type of the React element.
ja: JSX タグの先頭の部分は、React 要素の型を決定しています。

source: Capitalized types indicate that the JSX tag is referring to a React component.
ja: 大文字で始まる型は JSX タグが React コンポーネントを参照していることを示しています。

source: These tags get compiled into a direct reference to the named variable, so if you use the JSX `<Foo />` expression, `Foo` must be in scope.
ja: このような JSX タグはコンパイルを経てその大文字で始まる変数を直接参照するようになります。つまり JSX の `<Foo />` 式を使用する場合、`Foo` がスコープになければなりません。

source: ### React Must Be in Scope {#react-must-be-in-scope}
ja: ### React がスコープ内にあること {#react-must-be-in-scope}

source: Since JSX compiles into calls to `React.createElement`, the `React` library must also always be in scope from your JSX code.
ja: JSX は `React.createElement` の呼び出しへとコンパイルされるため、`React` ライブラリは常に JSX コードのスコープ内にある必要があります。

source: For example, both of the imports are necessary in this code, even though `React` and `CustomButton` are not directly referenced from JavaScript:
ja: 例えば以下のコードでは、`React` も `CustomButton` も JavaScript から直接は参照されていませんが、両方ともインポートされていることが必要です。

source: If you don't use a JavaScript bundler and loaded React from a `<script>` tag, it is already in scope as the `React` global.
ja: JavaScript のバンドルツールを使わずに `<script>` タグから React を読み込んでいる場合は、`React` はグローバル変数として既にスコープに入っています。

source: ### Using Dot Notation for JSX Type {#using-dot-notation-for-jsx-type}
ja: ### JSX 型にドット記法を使用する {#using-dot-notation-for-jsx-type}

source: You can also refer to a React component using dot-notation from within JSX.
ja: JSX の中においては、ドット記法を使うことによって React コンポーネントを参照することもできます。

source: This is convenient if you have a single module that exports many React components.
ja: これは単一のモジュールがたくさんの React コンポーネントをエクスポートしているような場合に便利です。

source: For example, if `MyComponents.DatePicker` is a component, you can use it directly from JSX with:
ja: 例えば、`MyComponents.DatePicker` というコンポーネントがあるのであれば、次のように JSX 内から直接利用することができます。

source: ### User-Defined Components Must Be Capitalized {#user-defined-components-must-be-capitalized}
ja: ### ユーザ定義のコンポーネントの名前は大文字で始めること {#user-defined-components-must-be-capitalized}

source: When an element type starts with a lowercase letter, it refers to a built-in component like `<div>` or `<span>` and results in a string `'div'` or `'span'` passed to `React.createElement`.
ja: ある要素の型が小文字から始まっているような場合、それは `<div>` や `<span>` のような組み込みのコンポーネントを参照しており、これらはそれぞれ `'div'` や `'span'` といった文字列に変換されて `React.createElement` に渡されます。

source: Types that start with a capital letter like `<Foo />` compile to `React.createElement(Foo)` and correspond to a component defined or imported in your JavaScript file.
ja: 一方で `<Foo />` のように大文字で始まる型は `React.createElement(Foo)` にコンパイルされ、JavaScript ファイルにおいて定義あるいはインポートされたコンポーネントを参照します。

source: We recommend naming components with a capital letter.
ja: コンポーネントを命名するときには、大文字から始めるようにしてください。

source: If you do have a component that starts with a lowercase letter, assign it to a capitalized variable before using it in JSX.
ja: もしすでに小文字から始まるコンポーネントを作ってしまっていたら、JSX 内で利用する前にいちど大文字から始まる変数に代入しておきましょう。

source: For example, this code will not run as expected:
ja: 例えば、以下のコードは期待通りには動きません。

source: // Wrong!
ja: // 間違った例。

source: This is a component and should have been capitalized: function hello(props) {
ja: これはコンポーネントなので、大文字ではじめなければいけません。function hello(props) {

source: // Correct!
ja: // 正しい例。

source: This use of <div> is legitimate because div is a valid HTML tag:
ja: div は HTML タグなので、<div> と書くのは正解です。

source: React thinks <hello /> is an HTML tag because it's not capitalized:
ja: 大文字ではじまっていないため、React は <hello /> を HTML タグと認識してしまいます。

source: To fix this, we will rename `hello` to `Hello` and use `<Hello />` when referring to it:
ja: `hello` を `Hello` に書き換え、`<Hello />` を使って参照するようにすれば、このコードはきちんと動作するようになります。

source: This is a component and should be capitalized: function Hello(props) {
ja: コンポーネントなので大文字からはじまっています。function Hello(props) {

source: React knows <Hello /> is a component because it's capitalized.
ja: 大文字ではじまっているため、React は <Hello /> がコンポーネントだと認識できます。

source: ### Choosing the Type at Runtime {#choosing-the-type-at-runtime}
ja: ### 実行時に型を選択する {#choosing-the-type-at-runtime}

source: You cannot use a general expression as the React element type.
ja: 一般的な式を React の要素の型として使用することはできません。

source: If you do want to use a general expression to indicate the type of the element, just assign it to a capitalized variable first.
ja: どうしても一般的な式を使って要素の型を示したいのであれば、まずその式を大文字から始まる変数に代入してから利用しましょう。

source: This often comes up when you want to render a different component based on a prop:
ja: これはプロパティの値に応じて異なるコンポーネントを表示し分けたいような場合によくあるケースです。

source: JSX type can't be an expression.
ja: 式は JSX の型に指定できません。

source: To fix this, we will assign the type to a capitalized variable first:
ja: 大文字から始まる変数に型を代入することで、上のコードをきちんと動作するようにしてみましょう。

source: JSX type can be a capitalized variable.
ja: 大文字で始まる変数は JSX の型に指定できます。

source: ## Props in JSX {#props-in-jsx}
ja: ## JSX における props {#props-in-jsx}

source: There are several different ways to specify props in JSX.
ja: JSX で props を指定するやり方はいくつかあります。

source: ### JavaScript Expressions as Props {#javascript-expressions-as-props}
ja: ### プロパティとしての JavaScript 式 {#javascript-expressions-as-props}

source: You can pass any JavaScript expression as a prop, by surrounding it with `{}`.
ja: 任意の JavaScript 式は `{}` で囲むことによって props として渡すことができます。

source: For example, in this JSX:
ja: 例として次の JSX を見てみましょう。

source: For `MyComponent`, the value of `props.foo` will be `10` because the expression `1 + 2 + 3 + 4` gets evaluated.
ja: この `MyComponent` について、`props.foo` の値は `10` 、つまり `1 + 2 + 3 + 4` という式が評価されます。

source: `if` statements and `for` loops are not expressions in JavaScript, so they can't be used in JSX directly.
ja: `if` 文や `for` 文は JavaScript においては式ではないため、JSX 内で直接利用することはできません。

source: Instead, you can put these in the surrounding code.
ja: 代わりに JSX の近くで間接的に利用してみてください。

source: For example:
ja: 次がその例です。

source: You can learn more about [conditional rendering](/docs/conditional-rendering.html) and [loops](/docs/lists-and-keys.html) in the corresponding sections.
ja: これについては、[条件付きレンダー](/docs/conditional-rendering.html)と[ループ](/docs/lists-and-keys.html)でさらに深く学ぶことができます。

source: ### String Literals {#string-literals}
ja: ### 文字列リテラル {#string-literals}

source: You can pass a string literal as a prop.
ja: 文字列リテラルを props として渡すことができます。

source: These two JSX expressions are equivalent:
ja: そのため以下のふたつの JSX の式はまったく等しいものとなります。

source: When you pass a string literal, its value is HTML-unescaped.
ja: 文字列リテラルを渡す際、その値における HTML エスケープは元の形に復元されます。

source: So these two JSX expressions are equivalent:
ja: そのため以下のふたつの JSX の式もまったく等しいものとなります。

source: This behavior is usually not relevant. It's only mentioned here for completeness.
ja: この振る舞いは多くの場合それほど重要なものではありませんが、包括的な解説の一環としてここで触れておきます。

source: ### Props Default to "True" {#props-default-to-true}
ja: ### プロパティのデフォルト値は true {#props-default-to-true}

source: If you pass no value for a prop, it defaults to `true`.
ja: プロパティに値を与えない場合、デフォルトの値は `true` となります。

source: In general, we don't recommend *not* passing a value for a prop, because it can be confused with the [ES6 object shorthand](https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Operators/Object_initializer#New_notations_in_ECMAScript_2015) `{foo}` which is short for `{foo: foo}` rather than `{foo: true}`. This behavior is just there so that it matches the behavior of HTML.
ja: 特別な理由がある場合を除いて、このように値を省略することは推奨していません。[ES6 におけるオブジェクトの簡略表記](https://developer.mozilla.org/en/docs/Web/JavaScript/Reference/Operators/Object_initializer#New_notations_in_ECMAScript_2015)においては、`{foo}` は `{foo: true}` ではなく `{foo: foo}` を意味するため、HTML の動作に似せて作られたこの機能はかえって混乱をきたす可能性があります。

source: ### Spread Attributes {#spread-attributes}
ja: ### 属性の展開 {#spread-attributes}

source: If you already have `props` as an object, and you want to pass it in JSX, you can use `...` as a "spread" operator to pass the whole props object.
ja: `props` オブジェクトがあらかじめ存在しており、それを JSX に渡したいような場合は `...` を「スプレッド」演算子として使用することで、props オブジェクトそのものを渡すことができます。

source: These two components are equivalent:
ja: そのため以下のふたつの JSX の式はまったく等しいものとなります。

source: You can also pick specific props that your component will consume while passing all other props using the spread operator.
ja: また、コンポーネントが利用する適当なプロパティを取り出しつつ、残りのすべてのプロパティに対してスプレッド演算子を利用することもできます。

source: In the example above, the `kind` prop is safely consumed and *is not* passed on to the `<button>` element in the DOM.
ja: 上の例では、`kind` プロパティは無事に取り出され、DOM 中の `<button>` 要素には*渡されていません*。

source: All other props are passed via the `...other` object making this component really flexible.
ja: 残りのプロパティは `...other` オブジェクトにより渡され、このコンポーネントを柔軟性の高いものにしています。

source: You can see that it passes an `onClick` and `children` props.
ja: 上記のコードは `onClick` や `children` プロパティを渡していることが見てとれるはずです。

source: Spread attributes can be useful but they also make it easy to pass unnecessary props to components that don't care about them or to pass invalid HTML attributes to the DOM. We recommend using this syntax sparingly.
ja: スプレッド演算子は便利ではありますが、コンポーネント内で利用しないプロパティを不用意に渡してしまったり、意味をなさない HTML 属性を DOM に渡してしまうようなことが容易に起きえます。そのためこの構文は慎重に利用してください。

source: ## Children in JSX {#children-in-jsx}
ja: ## JSX における子要素 {#children-in-jsx}

source: In JSX expressions that contain both an opening tag and a closing tag, the content between those tags is passed as a special prop: `props.children`.
ja: 開始タグと終了タグの両方を含む JSX 式においては、タグに囲まれた部分は、`props.children` という特別なプロパティとして渡されます。

source: There are several different ways to pass children:
ja: このような子要素を渡す方法はいくつかあります。

source: ### String Literals {#string-literals-1}
ja: ### 文字列リテラル {#string-literals-1}

source: You can put a string between the opening and closing tags and `props.children` will just be that string.
ja: 開始タグと終了タグの間に文字列を挟んでいる場合、その文字列が `props.children` となります。

source: This is useful for many of the built-in HTML elements.
ja: これは HTML 要素を JSX 内で利用するような場合よくあるケースです。

source: This is valid JSX, and `props.children` in `MyComponent` will simply be the string `"Hello world!"`.
ja: この JSX は正しく動作します。この場合 `props.children` は `MyComponent` において、単なる文字列 `"Hello world!"` となります。

source: HTML is unescaped, so you can generally write JSX just like you would write HTML in this way:
ja: HTML エスケープは元の文字列に復元されるため、多くの場合は以下のように HTML を書くように JSX を書くことができます。

source: JSX removes whitespace at the beginning and ending of a line. It also removes blank lines.
ja: JSX は行の先頭と末尾の空白文字を削除し、また空白行も削除します。

source: New lines adjacent to tags are removed; new lines that occur in the middle of string literals are condensed into a single space.
ja: タグに隣接する改行も削除され、文字列リテラル内での改行は 1 つの空白文字に置き換えられます。

source: So these all render to the same thing:
ja: そのため以下の例はすべて同じものを表示します。

source: ### JSX Children {#jsx-children}
ja: ### 子要素としての JSX 要素 {#jsx-children}

source: You can provide more JSX elements as the children.
ja: JSX 要素を子要素として渡すこともできます。

source: This is useful for displaying nested components:
ja: これはネストしたコンポーネントを表示したいときに活用することができます。

source: You can mix together different types of children, so you can use string literals together with JSX children.
ja: 異なる型の子要素を混在させることができるため、文字列リテラルを JSX 要素と同時に子要素として渡すことができます。

source: This is another way in which JSX is like HTML, so that this is both valid JSX and valid HTML:
ja: この点においても JSX と HTML は似ており、次のような例は JSX としても HTML としても正しく動作します。

source: A React component can also return an array of elements:
ja: また React コンポーネントは要素の配列を返すこともできます。

source: // No need to wrap list items in an extra element!
ja: // リスト化するだけのために要素を用意する必要はありません！

source: // Don't forget the keys :)
ja: // key 属性を書き忘れないようにしてください :)

source: ### JavaScript Expressions as Children {#javascript-expressions-as-children}
ja: ### 子要素としての JavaScript 式 {#javascript-expressions-as-children}

source: You can pass any JavaScript expression as children, by enclosing it within `{}`.
ja: 任意の JavaScript の式は `{}` で囲むことによって子要素として渡すことができます。

source: For example, these expressions are equivalent:
ja: そのため以下の JSX の式はまったく等しいものとなります。

source: This is often useful for rendering a list of JSX expressions of arbitrary length.
ja: これは長さの決まっていない JSX 式のリストを表示したいような場合に特に便利に使うことができます。

source: For example, this renders an HTML list:
ja: 次の例は HTML の表を表示します。

source: JavaScript expressions can be mixed with other types of children. This is often useful in lieu of string templates:
ja: JavaScript の式は異なる型の子要素と併用することができるため、テンプレートリテラルの代わりに次のような書き方をすることもできます。

source: ### Functions as Children {#functions-as-children}
ja: ### 子要素としての関数 {#functions-as-children}

source: Normally, JavaScript expressions inserted in JSX will evaluate to a string, a React element, or a list of those things.
ja: JSX タグに挟まれた JavaScript 式は、通常は文字列や React 要素、あるいはこれらのリストとして評価されます。

source: However, `props.children` works just like any other prop in that it can pass any sort of data, not just the sorts that React knows how to render.
ja: しかし、他のあらゆる props と同様に `props.children` にも任意のデータを渡すことができ、そのデータとは必ずしも React がレンダーできるものに限りません。

source: For example, if you have a custom component, you could have it take a callback as `props.children`:
ja: 例えば独自コンポーネントに `props.children` を通してコールバックを定義することもできるのです。

source: ```js{4,13} // Calls the children callback numTimes to produce a repeated component function Repeat(props) {
ja: ```js{4,13} // numTimes の数だけ子要素のコールバックを呼び出し、コンポーネントを繰り返し作成する function Repeat(props) {

source: Children passed to a custom component can be anything, as long as that component transforms them into something React can understand before rendering.
ja: 独自コンポーネントに渡される子要素は、レンダーが実行されるまでに React が理解できる要素に変換されている限りにおいては、どのようなものでも構いません。

source: This usage is not common, but it works if you want to stretch what JSX is capable of.
ja: このようなやり方は一般的ではありませんが、JSX をさらに拡張したくなった時には活用してみてください。

source: ### Booleans, Null, and Undefined Are Ignored {#booleans-null-and-undefined-are-ignored}
ja: ### 真偽値、null、undefined は無視される {#booleans-null-and-undefined-are-ignored}

source: `false`, `null`, `undefined`, and `true` are valid children.
ja: `true` と `false`、`null`、そして `undefined` は子要素として渡すことができます。

source: They simply don't render.
ja: これらは何もレンダーしません。

source: These JSX expressions will all render to the same thing:
ja: 以下の JSX の式はすべて同じ結果となります。

source: This can be useful to conditionally render React elements.
ja: これは条件に応じて React 要素を表示する際に活用できます。

source: This JSX renders the `<Header />` component only if `showHeader` is `true`:
ja: 次の例は `showHeader` が `true` のときに限って `<Header />` が表示されます。

source: One caveat is that some ["falsy" values](https://developer.mozilla.org/en-US/docs/Glossary/Falsy), such as the `0` number, are still rendered by React.
ja: 1 つ注意点として、数値 `0` のように ["falsy" な（偽と評価される）いくつかの値](https://developer.mozilla.org/en-US/docs/Glossary/Falsy)は、React によって表示されます。

source: For example, this code will not behave as you might expect because `0` will be printed when `props.messages` is an empty array:
ja: つまり次のコードは `props.messages` が空の配列のときには `0` が表示されてしまうため、期待通りには動作しません。

source: To fix this, make sure that the expression before `&&` is always boolean:
ja: `&&` の前の式が必ず真偽値となるようにすれば、期待通りに動作します。

source: Conversely, if you want a value like `false`, `true`, `null`, or `undefined` to appear in the output, you have to [convert it to a string](https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/String#String_conversion) first:
ja: 反対に、`false`、`true`、`null`、または `undefined` といった値を表示したいのであれば、まず[文字列に変換](https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/String#String_conversion)する必要があります。
